{
  "social": {
    "email": "chinecherem.nwoye.cn@gmail.com",
    "github": "https://github.com/nwoye-ezekiel",
    "twitter": "https://twitter.com/nwoye_ezekiel",
    "linkedIn": "https://www.linkedin.com/in/nwoyeezekiel/",
    "instagram": "https://instagram.com/nwoye_ezekiel"
  },
  "education": [
    {
      "degree": "React Developer Nanodegree",
      "school": "Udacity, Inc.",
      "timeline": { "from": "Jul 2021", "to": "Nov 2021" },
      "summary": "This nanodegree course extensively taught various technical skills needed to a build fully functional web and mobile application including:\n\n\t• React Fundamentals\n\t• React and Redux\n\t• React Native"
    },
    {
      "degree": "BSc. in Computer Engineering",
      "school": "University of Lagos, Nigeria.",
      "timeline": { "from": "Sep 2017", "to": "Aug 2022" },
      "summary": "• CGPA: 4.12 (In-View) \n\n• Relevant Coursework: Software Engineering Fundamentals, Computer Programming, Computer Architecture, Algorithms and Data Structures, Systems Programming, Machine and Assembly Language Programming, Digital Electronics, Digital Computer Design, Microprocessors & Microcomputers, Database Management, Computer Networks, Information Theory & Coding, Numerical Methods in Engineering, Technical Communication."
    }
  ],
  "work": [
    {
      "role": "Software Engineer",
      "location": "Lagos, Nigeria",
      "company": "Minerva Technologies Limited",
      "timeline": { "from": "Dec 2021", "to": "Present" },
      "summary": "• Worked on developing, testing, and maintaining their product (VPay Africa) which is a finance-based product for making transactions. \n• I have worked on creating reusable components, efficiently consuming Restful APIs, and using React to implement designs on the front-end."
    },
    {
      "role": "Front-End Engineer",
      "location": "Lagos, Nigeria",
      "company": "iQube Labs",
      "timeline": { "from": "May 2021", "to": "Oct 2021" },
      "summary": "• Worked with a team of developers in creating web apps for the general public. I Learnt how to use new and trending technologies effectively. Made use of Gliffy in designing software architectures for various projects.\n• My team and I worked on an online food platform with numerous services and features that includes live webinars, live classrooms, pre-ordering, quiz games, transactions with PayStack, user subscription, etc.\n•  Created several user interfaces and implemented designs using React, Typescript, Redux, SASS, using BitBucket for version control and Trello for team collaboration."
    },
    {
      "role": "Freelancer",
      "location": "Lagos, Nigeria",
      "company": "County Bites",
      "timeline": { "from": "Jul 2021", "to": "Aug 2021" },
      "summary": "• Worked on building a web application that depicts the brand and enlightens prospective clients of their services."
    },
    {
      "role": "Graphic Designer",
      "location": "Lagos, Nigeria",
      "company": "Stranerd",
      "timeline": { "from": "Jun 2021", "to": "July 2021" },
      "summary": "• For the contract duration, I was involved in the creation of graphic contents, as well as revamping the company website."
    },
    {
      "role": "Machine Learning Intern",
      "location": "Lagos, Nigeria",
      "company": "Babban Gona",
      "timeline": { "from": "Nov 2019", "to": "Jan 2020" },
      "summary": "• Participated in the annotation of objects for the creation of an improved machine learning model.\n• I learned more about machine learning and its various applications. \n•  I used internal services to create apps that could process huge datasets."
    }
  ],
  "projects": {
    "number-puzzle": {
      "name": "Number Puzzle",
      "description": "This is the most recent project I've worked on. It is a puzzle game that most people are acquainted with, having been played regularly during their infancy. This project was built with React, and it has received a lot of favorable comments. You may read the 'How to Play' description when the game launches, which will lead you and give you an overview of the game. When a game is paused, you may view a demo of how movements were performed to win the game from the menu modal.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644465194/puzzle_bjknvg.png",
      "gif_url": "",
      "live_url": "https://number-slide-puzzle.netlify.app",
      "github_url": "https://github.com/Nwoye-Ezekiel/number-puzzle"
    },
    "would-you-rather": {
      "name": "Would You Rather",
      "description": "This was one of my React Nanodegree Projects on Udacity and is one of my favorites. This is a question game in which you sign in as one of the already created users and begin answering questions that other users have posted but to which you have not yet answered. A poll result is created once you answer a question, and you may examine the statistics for that question. You level up on the scoreboard as you answer more questions and generate new questions, which are displayed on the leaderboard page. This project heavily focused on Redux which helped me to be a lot better at it.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644465274/would-you-rather_eqcdsk.png",
      "gif_url": "",
      "live_url": "https://the-would-you-rather-game.netlify.app",
      "github_url": "https://github.com/Nwoye-Ezekiel/would-you-rather"
    },
    "my-reads": {
      "name": "My Reads",
      "description": "This was my first practical project for the React Nanodegree Program, and it was designed to help me solidify my grasp of React principles, with a focus on state management. It's a virtual bookshelf where you may read books and then transfer them to other shelves, such as Currently Reading, Read or Want to read, based on what's most convenient at the time. You may also use the search page to look for books, add new books to the shelves, and remove them.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464021/my-reads1_xsqopn.png",
      "gif_url": "",
      "live_url": "https://the-reads-app.netlify.app/",
      "github_url": "https://github.com/Nwoye-Ezekiel/my-reads-app"
    },
    "mobile-flashcards": {
      "name": "Mobile Flashcards",
      "description": "This was my last React Nanodegree Project on Udacity, completing my degree and earning my certification. It was on React Native, and learning it for the first time was a lot of fun. Users may construct decks, and then add questions (along with answers) to the decks. Upon adding a card to a deck, a user can quiz themselves using that deck, which can be titled anything from 'Physics' to 'React.', etc. The card with the question on it may be flipped over to reveal the answer. You'll be scored after the quiz, and a local notification will be reset at that time to notify you at a particular time the next day if you haven't completed at least one quiz for that day.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644468946/flashcards_esvnul.png",
      "device_type": "mobile",
      "device_image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644465512/mobile.flashcards_gf4d5m.png",
      "gif_url": "",
      "live_url": null,
      "github_url": "https://github.com/Nwoye-Ezekiel/mobile-flashcards"
    },
    "county-bites": {
      "name": "County Bites",
      "description": "This was a project for a client in the United States. During my React Nanodegree program, I took on this project and used everything I'd learned thus far to develop this static website using React. This project necessitated several on-scroll animations, which I also implemented. County Bites is a social food and grocery delivery network that lets you find new restaurants in your region, get it delivered quickly and correctly, and pay the lowest delivery commission of any platform. It gives the greatest local cuisine to rural populations. The website encourages visitors to download the app, which is where all of the transactions take place",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464306/county-bites_c1eqof.png",
      "gif_url": "",
      "live_url": "https://county-bites.netlify.app/",
      "github_url": null
    },
    "time-stack": {
      "name": "Time Stack",
      "description": "Time Stack is a time management application that can help you close the gap in your productivity. This aim can be attained with proper time management, and time Stack is the man for the job. You may quickly create tasks, specify an expiry date for completion with a chosen priority level, and examine the statistics of all the tasks you have, whether finished or uncompleted, with precise information. This was my very first React Project which was created the following week after I just started learning it.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464396/time-stack_c3ojpn.png",
      "gif_url": "",
      "live_url": "https://timestack.netlify.app/",
      "github_url": "https://github.com/Nwoye-Ezekiel/stack"
    },
    "smash": {
      "name": "Smash",
      "description": "This was a game I made in the year 2020. I made this with HTML, CSS, and Vanilla JavaScript, with no prior knowledge of frameworks. It took a bit long since I couldn't make reusable components as I could with React, but it was all part of the learning process. This game has a similar feel to the popular 'Piano tiles' game, but it's a little different. In contrast to the latter, the tiles do not fall; instead, you smash tiles that display a specific hue, which is white. The game will be terminated if you respond late or smash the wrong tile. There are numerous difficulty levels in the game as well.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464487/snash_odfwqt.png",
      "gif_url": "",
      "live_url": "https://nwoye-ezekiel.github.io/smash/",
      "github_url": "https://github.com/Nwoye-Ezekiel/smash"
    },
    "iclock": {
      "name": "iClock",
      "description": "I was eager to construct projects in my early days of studying web technologies to show myself that I had what it takes. This was one of the projects I opted to work on, and it was named iClock. It's essentially an analog clock with a digital display built-in, as the name implies. The current month, date, and weekday are also displayed on this clock. It features a dark mode and a unique neumorphism design.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464703/iClock_xsdmtd.png",
      "gif_url": "",
      "live_url": "https://nwoye-ezekiel.github.io/iclock/",
      "github_url": "https://github.com/Nwoye-Ezekiel/iclock"
    },
    "money-rise": {
      "name": "Money Rise",
      "description": "This is a basic sign in page which doesn't use an actual api for authentication. This page gives a soothing feel as it includes an animation on page load. It also has a functional 'Remember me' checkbox for persisting user login credentials to better improve user experience. Other notable features includes a loading spinner and gradient animation on form hover.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644472163/money-rise_jpa4y0.png",
      "gif_url": "",
      "live_url": "https://money-rise.netlify.app/",
      "github_url": "https://github.com/Nwoye-Ezekiel/fe-intern-test"
    },
    "any-converter": {
      "name": "Any Converter",
      "description": "I deal with binary codes as a Computer Engineering student since they are highly important in my field and college courses. During a year in which I did a lot of binary calculations, I decided to try something new by using the little HTML, CSS, and JavaScript skills I had to make my own Decimal to Binary converter, which I used a lot when studying and practicing for tests and exams. I forwarded the link to my friends, who all took advantage of it.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464894/any-converter_w06nr3.png",
      "gif_url": "",
      "live_url": "https://nwoye-ezekiel.github.io/binary/",
      "github_url": "https://github.com/Nwoye-Ezekiel/binary"
    },
    "animated-cat": {
      "name": "Animated Cat",
      "description": "With my interest in animations, I attempted to build various animations using CSS as a means of improving my skills and producing cool effects. When I initially discovered how to utilize Keyframes, I decided to do something with it that not many people do. I made a cat replica and added animations to make it behave like a real cat. When I put it up on the internet, it drew a lot of attention and received a lot of positive responses.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644464957/cat_uzxi9y.png",
      "gif_url": "",
      "live_url": "https://nwoye-ezekiel.github.io/animation-cat/",
      "github_url": "https://github.com/Nwoye-Ezekiel/animation-cat"
    },
    "animated-wine-glass": {
      "name": "Animated Wine Glass",
      "description": "Still working on animations, when I realized how much I had progressed in CSS simply by trying to make one animation, I decided to devote more time to it. I didn't want to have that mindset after hearing a lot of people say how difficult CSS was for them to learn, so I attempted to incorporate very good animations to make it appear easy and also to raise the morale of my friends to spend more time and effort into it to get better. This animation creates the illusion of wine flowing in a wavy manner in a glass cup.",
      "image_url": "https://res.cloudinary.com/dbitfc2gx/image/upload/v1644465005/wine_mvoqjl.png",
      "gif_url": "",
      "live_url": "https://nwoye-ezekiel.github.io/Animation-WineGlass/",
      "github_url": "https://github.com/Nwoye-Ezekiel/Animation-WineGlass"
    }
  }
}
